#include "NativeMemory.hpp"
#include "ScriptDomain.hpp"

#include <Main.h>
#include <Psapi.h>

using namespace System;
using namespace System::Collections::Generic;
using namespace System::Collections::ObjectModel;
using namespace System::Runtime::InteropServices;

const char* const _cellEmailBcon = "CELL_EMAIL_BCON";
const char* const _string = "STRING";
const char* const _nullStr = "";

namespace GTA
{
	namespace Native
	{
		namespace
		{
			[StructLayout(LayoutKind::Explicit)]
			private value class EntityPool
			{
			public:
				[FieldOffset(0x10)]UInt32 num1;
				[FieldOffset(0x20)]UInt32 num2;

				inline bool Full()
				{
					return num1 - (num2 & 0x3FFFFFFF) <= 256;
				}
			};

			[StructLayout(LayoutKind::Explicit)]
			private value class VehiclePool
			{
			public:
				[FieldOffset(0x00)]UInt64 *poolAddress;
				[FieldOffset(0x08)]UInt32 size;
				[FieldOffset(0x30)]UInt32* bitArray;
				[FieldOffset(0x60)]UInt32 itemCount;

				inline bool isValid(UInt32 i)
				{
					return (bitArray[i >> 5] >> (i & 0x1F)) & 1;
				}

				inline UInt64 getAddress(UInt32 i)
				{
					return poolAddress[i];
				}
			};

			[StructLayout(LayoutKind::Explicit)]
			private value class GenericPool{
			public:
				[FieldOffset(0x00)] UInt64 poolStartAddress;
				[FieldOffset(0x08)] Byte* byteArray;
				[FieldOffset(0x10)] UInt32 size;
				[FieldOffset(0x14)] UInt32 itemSize;


				inline bool isValid(UInt32 i)
				{
					return mask(i) != 0;
				}

				inline UInt64 getAddress(UInt32 i)
				{
					return mask(i) & (poolStartAddress + i * itemSize);
				}
			private:
				inline long long mask(UInt32 i)
				{
					long long num1 = byteArray[i] & 0x80;
					return ~((num1 | -num1) >> 63);
				}
			};


			private ref struct EntityPoolTask : IScriptTask
			{
				enum class Type
				{
					Ped=1,
					Object=2,
					Vehicle=4,
					PickupObject=8
				};

				EntityPoolTask(Type type) : _type(type) { }

				inline bool CheckEntity(uintptr_t address)
				{
					if (_posCheck)
					{
						float position[3];
						MemoryAccess::_entityPositionFunc(address, position);

						if(_position.DistanceToSquared(Math::Vector3(position[0], position[1], position[2])) > _radiusSquared)
						{
							return false;
						}
					}

					if (_modelCheck)
					{
